note_back/python基础教程（第三版）.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-07 Sun 12:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python基础教程（第三版）</title>
<meta name="author" content="ShadowFish chen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python基础教程（第三版）</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5aa7ca9">1. 第1章 快速上手：基础知识</a>
<ul>
<li><a href="#org7f01699">1.1. 进入python的交互环境</a></li>
<li><a href="#org42e9c26">1.2. 算法</a></li>
<li><a href="#orga3ed7d5">1.3. 数和表达式</a>
<ul>
<li><a href="#org2d71e0f">1.3.1. 基本的运算：</a></li>
</ul>
</li>
<li><a href="#orgfb09a07">1.4. 变量（variable）</a></li>
<li><a href="#orgc72daea">1.5. 获取用户输入（input（））</a></li>
<li><a href="#orgccf6cc8">1.6. 函数</a>
<ul>
<li><a href="#orgcf77b93">1.6.1. 内置函数</a></li>
</ul>
</li>
<li><a href="#orgb6a4d04">1.7. 模块</a>
<ul>
<li><a href="#org847ace2">1.7.1. 导入模块 import module</a></li>
<li><a href="#orgabd25e0">1.7.2. import的变种 from module import function</a></li>
<li><a href="#orgb6665cf">1.7.3. _future _ 模块</a></li>
</ul>
</li>
<li><a href="#org576257d">1.8. 保存并执行程序</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5aa7ca9" class="outline-2">
<h2 id="org5aa7ca9"><span class="section-number-2">1.</span> 第1章 快速上手：基础知识</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7f01699" class="outline-3">
<h3 id="org7f01699"><span class="section-number-3">1.1.</span> 进入python的交互环境</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>mac OS 或 linux/Unix下
终端下输入python（python3）</li>
<li>图形界面
终端输入IDLE，启动idle图形界面的解释器</li>
</ol>
</div>
</div>
<div id="outline-container-org42e9c26" class="outline-3">
<h3 id="org42e9c26"><span class="section-number-3">1.2.</span> 算法</h3>
</div>
<div id="outline-container-orga3ed7d5" class="outline-3">
<h3 id="orga3ed7d5"><span class="section-number-3">1.3.</span> 数和表达式</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org2d71e0f" class="outline-4">
<h4 id="org2d71e0f"><span class="section-number-4">1.3.1.</span> 基本的运算：</h4>
<div class="outline-text-4" id="text-1-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">运算符</td>
<td class="org-left">作用</td>
</tr>

<tr>
<td class="org-left">//</td>
<td class="org-left">整除（结果取整）</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">取余数</td>
</tr>

<tr>
<td class="org-left">**</td>
<td class="org-left">乘方（求幂）</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgfb09a07" class="outline-3">
<h3 id="orgfb09a07"><span class="section-number-3">1.4.</span> 变量（variable）</h3>
<div class="outline-text-3" id="text-1-4">
<p>
使用python变量前，必须先赋值（assignment），because python变量没有默认值
</p>
</div>
</div>
<div id="outline-container-orgc72daea" class="outline-3">
<h3 id="orgc72daea"><span class="section-number-3">1.5.</span> 获取用户输入（input（））</h3>
<div class="outline-text-3" id="text-1-5">
<p>
用法：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c678dd;">input</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"The meaning of life: "</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgccf6cc8" class="outline-3">
<h3 id="orgccf6cc8"><span class="section-number-3">1.6.</span> 函数</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgcf77b93" class="outline-4">
<h4 id="orgcf77b93"><span class="section-number-4">1.6.1.</span> 内置函数</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
内置函数的例子：
</p>
<ul class="org-ul">
<li>power（2，3）      //表示2的3次方</li>
<li>abs(-10)          //求绝对值</li>
<li>sqrt（9）         //求平方根</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb6a4d04" class="outline-3">
<h3 id="orgb6a4d04"><span class="section-number-3">1.7.</span> 模块</h3>
<div class="outline-text-3" id="text-1-7">
<p>
可将模块视为扩展，通过将其导入可以扩展python的功能。 
</p>
</div>
<div id="outline-container-org847ace2" class="outline-4">
<h4 id="org847ace2"><span class="section-number-4">1.7.1.</span> 导入模块 import module</h4>
<div class="outline-text-4" id="text-1-7-1">
</div>
<ol class="org-ol">
<li><a id="orgc92b2cf"></a>import的实例<br />
<div class="outline-text-5" id="text-1-7-1-1">
<p>
import math    //导入数学模块math
math.floor(32.9)   //floor()是math模块中的函数
</p>
</div>
</li>
<li><a id="orgaa50142"></a>import的工作原理<br />
<div class="outline-text-5" id="text-1-7-1-2">
<p>
使用import导入模块，再以module.function的方式使用模块中的函数。
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgabd25e0" class="outline-4">
<h4 id="orgabd25e0"><span class="section-number-4">1.7.2.</span> import的变种 from module import function</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
使用这个变种，可以在调用函数时不指定模块前缀。
</p>
</div>
</div>
<div id="outline-container-orgb6665cf" class="outline-4">
<h4 id="orgb6665cf"><span class="section-number-4">1.7.3.</span> _future _ 模块</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
对于python当前不支持，但未来将成为标准组成部分的功能，可以从这个模块导入
</p>
</div>
</div>
</div>
<div id="outline-container-org576257d" class="outline-3">
<h3 id="org576257d"><span class="section-number-3">1.8.</span> 保存并执行程序</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>扩展名 .py</li>
<li>IDLE</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ShadowFish chen</p>
<p class="date">Created: 2025-12-07 Sun 12:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
